БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПорядокОтраженияДоходов(ПорядокОтраженияЗатрат) Экспорт
	
	Если ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление;
	ИначеЕсли ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам  Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам ;
	ИначеЕсли  ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга ;
	КонецЕсли;
	
	Возврат Перечисления.CW_ПорядокОтраженияДоходов.ПустаяСсылка()
	
КонецФункции

#КонецЕсли
